## Terraform Plan Result


### environments/stg/network/vpc
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-southeast-2"
      + tags     = {
          + "Name" = "stg-main-vpc-igw"
        }
      + tags_all = {
          + "Name" = "stg-main-vpc-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-southeast-2"
      + tags                                 = {
          + "Name" = "stg-main-vpc"
        }
      + tags_all                             = {
          + "Name" = "stg-main-vpc"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + igw_id         = (known after apply)
  + vpc_cidr_block = "10.0.0.0/16"
  + vpc_id         = (known after apply)
```
<!-- Sticky Pull Request Commentterraform-plan -->